#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=26aa7ec7-96f9-4fda-a56c-b330c975f800-8e001e75-263f-4b2f-931e-f2037fcc675f-a26cff92-ab53-4342-8e68-f96dd7bbd9b4]
azuread_application.github_actions_aadapplication["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5]
azuread_application_federated_identity_credential.cred["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5/federatedIdentityCredential/780736fb-df2b-4609-80e8-eab432153ec6]
azuread_service_principal.github_actions_sp["backstage_test"]: Refreshing state... [id=a7661791-72fe-4907-a9b2-2aa885ef3ea5]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common]
azurerm_storage_account.terraform_state_storage: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta]
azurerm_storage_container.terraform_state: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/common-infrastructure-tfstate]
azurerm_storage_container.tf_backends_sc["backstage_test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/backstage-testing]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_container.tf_backends_sc["backstage_test"] must be replaced
-/+ resource "azurerm_storage_container" "tf_backends_sc" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://badbortcommontfstatesta.blob.core.windows.net/backstage-testing" -> (known after apply)
      ~ metadata                = {
          + "repo" = "https://github.com/bortington/backstage-test"
        }
      ~ name                    = "backstage-testing" -> "backstage-test" # forces replacement
      ~ resource_manager_id     = "/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/backstage-testing" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*